W7D3/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name") VALUES ($1) RETURNING "id"  [["name", "metallica"]]
---
  def create
    @band = Band.new(band_params)
    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1 WHERE "bands"."id" = $2  [["name", "Metallica"], ["id", 1]]
---
  def update
    @band = Band.find_by(id: params[:id])
    if @band.update(band_params)